org/roam/hardware.org
:PROPERTIES:
:ID:       797885a6-0f94-4d02-9df2-2744d5526c4c
:END:
#+title: hardware
#+OPTIONS: toc:nil num:nil date:nil \n:nil html-style:nil author:nil timestamp:nil title:nil html-postamble:nil html5-fancy:t
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="org-default.css" />
#+HTML_CONTENT_CLASS: container
#+HTML_DOCTYPE: html5
#+INCLUDE: "css.org::navbar" :only-contents t
* hardware
Mechanical Sympathy Symphony
** RAM
 - ddr5 has on die ecc
*** SRAM
  - multiple transistors for faster memory (cpu cache)
*** DRAM
  - transistor and capacitor(needs refresh to not leak)
*** HBM
  - high bandwidth memory stacked in 3D
*** GDDR
  - GPU ram
** CPU
 - https://travisdowns.github.io/blog/2019/06/11/speed-limits.html
** Backdoors
  - [[https://research.tue.nl/files/197416841/20220325_Appelbaum_hf.pdf][ubiquity devices]](unifi)
    - any calvium processor
    - amazon hsm
  - intel management engine
  - amd platform security processor
  - firmware level malware (disk controller, usb controller, flashable uefi/bios etc)
  - side channel data transmission such as AM https://github.com/fulldecent/system-bus-radio or differential power analysis
  - printers watermark pages and refuse to print without yellow ink
** defective
  - Commonly defective (cheap companies and lack of quality control even with standards)
    - HDMI cables (no hdcp, artifacts and non spec bandwidth limits)
    - USBC charging (will not charge certain devices and can even damage ex. Nintendo Switch)
      - lacking resistors usually to inform device of power
    - refurbished drives (smart data wiped)
      - fake drives sold on amazon/walmart/ebay with custom firmware to trick os
    - Used GPUs (cryptocurreny mining wear and cheap factory solder)
** keyboards/switches
  - german cherry mx factory testing for switches https://youtu.be/Pu1gP4PfqCQ?t=240
    - brown switches are 45g for actuation, 55 for bottom out
  - Taiwanese Ducky Shine 4
    - firmware and processor on board
    - hold the Fn key and press the f10 key for lighting cycle
    - https://www.duckychannel.net/download/user_manual/Ducky_Shine_4_UserManual.pdf
** firmware
*** libreboot
    - Dell latitude 6530 requires me-cleaner injected into release
      - injection script in lbmk disables me automatically
      - thermal/power issues when workload is started quickly after boot (compiling code)
        - reverted back to stock firmware
    - seabios with grub rom requires escape key for grub boot menu
** GPS
  - CoCom Limits is the limit placed on GPS devices that disables tracking when it is faster than 1,000 knots and/or an higher than 18,000m.
    - Intended to prevent GPS in intercontinental ballistic missile applications.
    - SDR may not enforce limits (ex. GNSS-SDR)
** SDR
  - krakensdr passive receiver ITAR restricted and censored after IEEE spectrum paper
** storage
- Project silica (quartz/glass hard drives)
  - [[https://www.microsoft.com/en-us/research/project/project-silica/][research project by microsoft]]
  - 10000 year degrade time instead of 10 year like most optical mediums
- intel optane persistent high write nvme SSD cache
  - [[https://ieeexplore.ieee.org/document/9387168][ULTRARAM]] quantum RAM paper

** sim
- iphone14 removed sim card for esim.

** clock
- atomic clocks
  - https://www.physics.ox.ac.uk/news/quantum-network-entangled-atomic-clocks
    - optical atmoic clocks entangled on demand
  - helps approximate 'proper' time
  - nuclear atmoic clocks
    - caesium
    - Rubidium
    - GPS in the us uses ~4 per sat (2 caesium and 2 rubidium) to get 'absolute' time and spatial position
    - some NTP nodes use them (NTP is millisecond precision)

** gpu
- egpus for external gpu
  - OCuLink (optical-copper link) for PCIe connectivity
- dual issues instructions level pointer for memory and compute in a single cycle
** ISA
- RISC-V
  - free ISA
  - 32/64/128(wip) address spaces
  - 32 (16 embeded) int registers
  - 32 floating point registers
- Instructions are decoded into micro ops from bit patterns and executed via ports
- ARM
  - thumb instructions are reduced to 16bit with half the registers
    - x86 equivalent is operand size prefix as it is cisc
** sim
- Breadboard
  - simulation https://www.withdiode.com/

** agriculture
- /r/unclebens rice packets to cultivate mushrooms

** radio
- BaoFeng programmable in unregistered frequency with CHIRP

** firearms
- 'auto sear' plastic converts gun to fully automatic
- tannerite is used for exploding targets
- 50 yard zero raises 1.5inches and zeros again at 200
- 100 yard zero drops after
- LE uses 36 yard
** vehicle
- forscan
  - [[https://forscan.org/support/prepare_trial_el_request.php?lang=en][Require extended license for modification]]. can request multiple.
  - Add user to the ~dialout~ group (debian/fedora) or the ~uucp~ (arch) group then reboot.
  - wine v8.6.0 (used 8.3), forscan v 2.3.53
    - switch should be in the HS position. Forscan will prompt for MS toggle.
    - ~ln -s /dev/ttyUSB0 ~/.wine/dosdevices/com1~
    - under Configuration and Programming
      - EASY MODE (Regular configuration of popular newer models)
        - Run the module APIM
          - edit siriusxm travel link to off
        - BdyCM
          - Fog lights on (bambi mode: high and low beams)
      - MANUAL (AS BUILT) ~not recommended without spreadsheet of values~
        - ~MAKE SURE TO HIT SAVE ALL BEFORE ANY CHANGES~ name the file stock_MODULE.abt
        - Run the Module BdyCM(AS BUILT FORMAT)
          - To disable double honk Edit the entry for: ~726-41-02~ and change the FIRST box to ~0000~ instead of ~0001~. Then click write. LAST DIGIT
        - Run the module IPC(AS BUILT FORMAT)
          - To disable seatbelt chime Edit the entry for IPC ~720-01-01~ Edit the SECOND box to have the THIRD digit be ~0~ (2 for driver only, 4 is passenger, 0 is both). Then click write
- 2021 F150 has 'self driving' BlueCruise
  - raptor does not due to software issues with off road mode
  - [[https://github.com/flowdriveai/flowpilot][generic openpilot]]
  - [[https://github.com/roxasthenobody98/phoenixpilot][open pilot fork for lariat and above]]
    - OBD 2 connector with ForScan can enable Lane assist without the technology package
      - [[https://www.f150forum.com/f118/openpilot-469489/index6/#post7077158][need short/button to toggle while driving]]
** board games
- pathfinder system like dnd 3.3
- dnd 5e cap 20
- whitewolf d10 had games in 90's

** health
- supra-supramaximal inspiration for curing hiccups (breathing technique that increases co2 in blood)
