hardware.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>hardware</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="org-default.css" />
</head>
<body>
<div id="content" class="container">
<nav aria-label="breadcrumb" style="--pico-nav-breadcrumb-divider: '|';" id="org03c7be9">
<ul class="org-ul">
<li><a href="index.html#ID-3a34d6d7-6f37-4573-b20e-3c93894e54ac">🏠</a></li>
<li><a href="site_map.html#ID-30ea5e38-9b41-4bcd-8631-76821e93e294">🗺</a></li>
</ul>
</nav>
<div id="outline-container-orgbf5ea3e" class="outline-2">
<h2 id="orgbf5ea3e">hardware</h2>
<div class="outline-text-2" id="text-orgbf5ea3e">
<p>
Mechanical Sympathy Symphony
</p>
</div>
<div id="outline-container-orgbcaa699" class="outline-3">
<h3 id="orgbcaa699">RAM</h3>
<div class="outline-text-3" id="text-orgbcaa699">
<ul class="org-ul">
<li>ddr5 has on die ecc</li>
</ul>
</div>
<div id="outline-container-org31d52cd" class="outline-4">
<h4 id="org31d52cd">SRAM</h4>
<div class="outline-text-4" id="text-org31d52cd">
<ul class="org-ul">
<li>multiple transistors for faster memory (cpu cache)</li>
</ul>
</div>
</div>
<div id="outline-container-orgc22e461" class="outline-4">
<h4 id="orgc22e461">DRAM</h4>
<div class="outline-text-4" id="text-orgc22e461">
<ul class="org-ul">
<li>transistor and capacitor(needs refresh to not leak)</li>
</ul>
</div>
</div>
<div id="outline-container-orgf769024" class="outline-4">
<h4 id="orgf769024">HBM</h4>
<div class="outline-text-4" id="text-orgf769024">
<ul class="org-ul">
<li>high bandwidth memory stacked in 3D</li>
</ul>
</div>
</div>
<div id="outline-container-orgb1482f1" class="outline-4">
<h4 id="orgb1482f1">GDDR</h4>
<div class="outline-text-4" id="text-orgb1482f1">
<ul class="org-ul">
<li>GPU ram</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org71d2335" class="outline-3">
<h3 id="org71d2335">CPU</h3>
<div class="outline-text-3" id="text-org71d2335">
<ul class="org-ul">
<li><a href="https://travisdowns.github.io/blog/2019/06/11/speed-limits.html">https://travisdowns.github.io/blog/2019/06/11/speed-limits.html</a></li>
</ul>
</div>
<div id="outline-container-org9c3a275" class="outline-4">
<h4 id="org9c3a275">Intel</h4>
<div class="outline-text-4" id="text-org9c3a275">
<ul class="org-ul">
<li>haswell added hardware lock elision (HLE) with intel TSX
<ul class="org-ul">
<li>disabled in microcode due to security issues with instructions added later for mitigations</li>
<li>QEMU has options for passthrough <code>tsx-ctrl</code></li>
<li>RSPCS3 used it for large framerate improvements</li>
</ul></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org16e6abe" class="outline-3">
<h3 id="org16e6abe">Backdoors</h3>
<div class="outline-text-3" id="text-org16e6abe">
<ul class="org-ul">
<li><a href="https://research.tue.nl/files/197416841/20220325_Appelbaum_hf.pdf">ubiquity devices</a>(unifi)
<ul class="org-ul">
<li>any calvium processor</li>
<li>amazon hsm</li>
</ul></li>
<li>intel management engine</li>
<li>amd platform security processor</li>
<li>firmware level malware (disk controller, usb controller, flashable uefi/bios etc)</li>
<li>side channel data transmission such as AM <a href="https://github.com/fulldecent/system-bus-radio">https://github.com/fulldecent/system-bus-radio</a> or differential power analysis</li>
<li>printers watermark pages and refuse to print without yellow ink</li>
</ul>
</div>
</div>
<div id="outline-container-org8ced658" class="outline-3">
<h3 id="org8ced658">defective</h3>
<div class="outline-text-3" id="text-org8ced658">
<ul class="org-ul">
<li>Commonly defective (cheap companies and lack of quality control even with standards)
<ul class="org-ul">
<li>HDMI cables (no hdcp, artifacts and non spec bandwidth limits)</li>
<li>USBC charging (will not charge certain devices and can even damage ex. Nintendo Switch)
<ul class="org-ul">
<li>lacking resistors usually to inform device of power</li>
</ul></li>
<li>refurbished drives (smart data wiped)
<ul class="org-ul">
<li>fake drives sold on amazon/walmart/ebay with custom firmware to trick os</li>
</ul></li>
<li>Used GPUs (cryptocurreny mining wear and cheap factory solder)</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org70335c1" class="outline-3">
<h3 id="org70335c1">keyboards/switches</h3>
<div class="outline-text-3" id="text-org70335c1">
<ul class="org-ul">
<li>german cherry mx factory testing for switches <a href="https://youtu.be/Pu1gP4PfqCQ?t=240">https://youtu.be/Pu1gP4PfqCQ?t=240</a>
<ul class="org-ul">
<li>brown switches are 45g for actuation, 55 for bottom out</li>
</ul></li>
<li>Taiwanese Ducky Shine 4
<ul class="org-ul">
<li>firmware and processor on board</li>
<li>hold the Fn key and press the f10 key for lighting cycle</li>
<li><a href="https://www.duckychannel.net/download/user_manual/Ducky_Shine_4_UserManual.pdf">https://www.duckychannel.net/download/user_manual/Ducky_Shine_4_UserManual.pdf</a></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org923563a" class="outline-3">
<h3 id="org923563a">firmware</h3>
<div class="outline-text-3" id="text-org923563a">
</div>
<div id="outline-container-org28a3af3" class="outline-4">
<h4 id="org28a3af3">libreboot</h4>
<div class="outline-text-4" id="text-org28a3af3">
<ul class="org-ul">
<li>Dell latitude 6530 requires me-cleaner injected into release
<ul class="org-ul">
<li>injection script in lbmk disables me automatically</li>
<li>thermal/power issues when workload is started quickly after boot (compiling code)
<ul class="org-ul">
<li>reverted back to stock firmware</li>
</ul></li>
</ul></li>
<li>seabios with grub rom requires escape key for grub boot menu</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org1ffa91c" class="outline-3">
<h3 id="org1ffa91c">GPS</h3>
<div class="outline-text-3" id="text-org1ffa91c">
<ul class="org-ul">
<li>CoCom Limits is the limit placed on GPS devices that disables tracking when it is faster than 1,000 knots and/or an higher than 18,000m.
<ul class="org-ul">
<li>Intended to prevent GPS in intercontinental ballistic missile applications.</li>
<li>SDR may not enforce limits (ex. GNSS-SDR)</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgd11e643" class="outline-3">
<h3 id="orgd11e643">SDR</h3>
<div class="outline-text-3" id="text-orgd11e643">
<ul class="org-ul">
<li>krakensdr passive receiver ITAR restricted and censored after IEEE spectrum paper</li>
</ul>
</div>
</div>
<div id="outline-container-orge919464" class="outline-3">
<h3 id="orge919464">storage</h3>
<div class="outline-text-3" id="text-orge919464">
<ul class="org-ul">
<li>Project silica (quartz/glass hard drives)
<ul class="org-ul">
<li><a href="https://www.microsoft.com/en-us/research/project/project-silica/">research project by microsoft</a></li>
<li>10000 year degrade time instead of 10 year like most optical mediums</li>
</ul></li>
<li>intel optane persistent high write nvme SSD cache
<ul class="org-ul">
<li><a href="https://ieeexplore.ieee.org/document/9387168">ULTRARAM</a> quantum RAM paper</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org255bffe" class="outline-3">
<h3 id="org255bffe">sim</h3>
<div class="outline-text-3" id="text-org255bffe">
<ul class="org-ul">
<li>iphone14 removed sim card for esim.</li>
</ul>
</div>
</div>
<div id="outline-container-org1e61cf9" class="outline-3">
<h3 id="org1e61cf9">clock</h3>
<div class="outline-text-3" id="text-org1e61cf9">
<ul class="org-ul">
<li>atomic clocks
<ul class="org-ul">
<li><a href="https://www.physics.ox.ac.uk/news/quantum-network-entangled-atomic-clocks">https://www.physics.ox.ac.uk/news/quantum-network-entangled-atomic-clocks</a>
<ul class="org-ul">
<li>optical atmoic clocks entangled on demand</li>
</ul></li>
<li>helps approximate 'proper' time</li>
<li>nuclear atmoic clocks
<ul class="org-ul">
<li>caesium</li>
<li>Rubidium</li>
<li>GPS in the us uses ~4 per sat (2 caesium and 2 rubidium) to get 'absolute' time and spatial position</li>
<li>some NTP nodes use them (NTP is millisecond precision)</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org9554c49" class="outline-3">
<h3 id="org9554c49">gpu</h3>
<div class="outline-text-3" id="text-org9554c49">
<ul class="org-ul">
<li>egpus for external gpu
<ul class="org-ul">
<li>OCuLink (optical-copper link) for PCIe connectivity</li>
</ul></li>
<li>dual issues instructions level pointer for memory and compute in a single cycle</li>
</ul>
</div>
</div>
<div id="outline-container-org08e995c" class="outline-3">
<h3 id="org08e995c">ISA</h3>
<div class="outline-text-3" id="text-org08e995c">
<ul class="org-ul">
<li>RISC-V
<ul class="org-ul">
<li>free ISA</li>
<li>32/64/128(wip) address spaces</li>
<li>32 (16 embeded) int registers</li>
<li>32 floating point registers</li>
</ul></li>
<li>Instructions are decoded into micro ops from bit patterns and executed via ports</li>
<li>ARM
<ul class="org-ul">
<li>thumb instructions are reduced to 16bit with half the registers
<ul class="org-ul">
<li>x86 equivalent is operand size prefix as it is cisc</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orga949f22" class="outline-3">
<h3 id="orga949f22">sim</h3>
<div class="outline-text-3" id="text-orga949f22">
<ul class="org-ul">
<li>Breadboard
<ul class="org-ul">
<li>simulation <a href="https://www.withdiode.com/">https://www.withdiode.com/</a></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org1e19a1f" class="outline-3">
<h3 id="org1e19a1f">agriculture</h3>
<div class="outline-text-3" id="text-org1e19a1f">
<ul class="org-ul">
<li>/r/unclebens rice packets to cultivate mushrooms</li>
</ul>
</div>
</div>
<div id="outline-container-org3ecfd3c" class="outline-3">
<h3 id="org3ecfd3c">radio</h3>
<div class="outline-text-3" id="text-org3ecfd3c">
<ul class="org-ul">
<li>BaoFeng programmable in unregistered frequency with CHIRP</li>
</ul>
</div>
</div>
<div id="outline-container-org4e5920d" class="outline-3">
<h3 id="org4e5920d">firearms</h3>
<div class="outline-text-3" id="text-org4e5920d">
<ul class="org-ul">
<li>'auto sear' plastic converts gun to fully automatic</li>
<li>tannerite is used for exploding targets</li>
<li>50 yard zero raises 1.5inches and zeros again at 200</li>
<li>100 yard zero drops after</li>
<li>LE uses 36 yard</li>
</ul>
</div>
</div>
<div id="outline-container-orgcda3d64" class="outline-3">
<h3 id="orgcda3d64">vehicle</h3>
<div class="outline-text-3" id="text-orgcda3d64">
<ul class="org-ul">
<li>forscan
<ul class="org-ul">
<li><a href="https://forscan.org/support/prepare_trial_el_request.php?lang=en">Require extended license for modification</a>. can request multiple.</li>
<li>Add user to the <code>dialout</code> group (debian/fedora) or the <code>uucp</code> (arch) group then reboot.</li>
<li>wine v8.6.0 (used 8.3), forscan v 2.3.53
<ul class="org-ul">
<li>switch should be in the HS position. Forscan will prompt for MS toggle.</li>
<li><code>ln -s /dev/ttyUSB0 ~/.wine/dosdevices/com1</code></li>
<li>under Configuration and Programming
<ul class="org-ul">
<li>EASY MODE (Regular configuration of popular newer models)
<ul class="org-ul">
<li>Run the module APIM
<ul class="org-ul">
<li>edit siriusxm travel link to off</li>
</ul></li>
<li>BdyCM
<ul class="org-ul">
<li>Fog lights on (bambi mode: high and low beams)</li>
</ul></li>
</ul></li>
<li>MANUAL (AS BUILT) <code>not recommended without spreadsheet of values</code>
<ul class="org-ul">
<li><code>MAKE SURE TO HIT SAVE ALL BEFORE ANY CHANGES</code> name the file stock<sub>MODULE.abt</sub></li>
<li>Run the Module BdyCM(AS BUILT FORMAT)
<ul class="org-ul">
<li>To disable double honk Edit the entry for: <code>726-41-02</code> and change the FIRST box to <code>0000</code> instead of <code>0001</code>. Then click write. LAST DIGIT</li>
</ul></li>
<li>Run the module IPC(AS BUILT FORMAT)
<ul class="org-ul">
<li>To disable seatbelt chime Edit the entry for IPC <code>720-01-01</code> Edit the SECOND box to have the THIRD digit be <code>0</code> (2 for driver only, 4 is passenger, 0 is both). Then click write</li>
</ul></li>
</ul></li>
</ul></li>
</ul></li>
</ul></li>
<li>2021 F150 has 'self driving' BlueCruise
<ul class="org-ul">
<li>raptor does not due to software issues with off road mode</li>
<li><a href="https://github.com/flowdriveai/flowpilot">generic openpilot</a></li>
<li><a href="https://github.com/roxasthenobody98/phoenixpilot">open pilot fork for lariat and above</a>
<ul class="org-ul">
<li>OBD 2 connector with ForScan can enable Lane assist without the technology package
<ul class="org-ul">
<li><a href="https://www.f150forum.com/f118/openpilot-469489/index6/#post7077158">need short/button to toggle while driving</a></li>
</ul></li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org541a144" class="outline-3">
<h3 id="org541a144">board games</h3>
<div class="outline-text-3" id="text-org541a144">
<ul class="org-ul">
<li>pathfinder system like dnd 3.3</li>
<li>dnd 5e cap 20</li>
<li>whitewolf d10 had games in 90's</li>
</ul>
</div>
</div>
<div id="outline-container-org3d941c0" class="outline-3">
<h3 id="org3d941c0">health</h3>
<div class="outline-text-3" id="text-org3d941c0">
<ul class="org-ul">
<li>supra-supramaximal inspiration for curing hiccups (breathing technique that increases co2 in blood)</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
